{
  "name": "Airport vocabulary",
  "description": "Airport-related vocabulary covering check-in, security, in-flight terms, and more.",
  "words": [
    { "word": "CHECK-IN COUNTER", "hint": "Place to show ticket and ID; get your boarding pass." },
    { "word": "BOARDING PASS", "hint": "Document giving you access to the plane and seat number." },
    { "word": "SECURITY CHECK", "hint": "Screening process to ensure passenger safety." },
    { "word": "GATE", "hint": "Area where you wait for your flight; has a specific number." },
    { "word": "BAGGAGE CLAIM", "hint": "Place to collect your checked bags after landing." },
    { "word": "CUSTOMS", "hint": "Officials check what you're bringing into the country." },
    { "word": "IMMIGRATION", "hint": "Show passport and visa; controls entry to the country." },
    { "word": "LUGGAGE TROLLEY", "hint": "Cart for carrying bags, usually found in baggage claim." },
    { "word": "DEPARTURE LOUNGE", "hint": "Area to relax before flight; has seats, shops, restaurants." },
    { "word": "CARRY-ON", "hint": "Bags you bring onto the plane; have size/weight limits." },
    { "word": "PRIORITY BOARDING", "hint": "Allows boarding early; may cost extra or be included with premium tickets." },
    { "word": "E-TICKET", "hint": "Electronic version of your ticket, often on your mobile device." },
    { "word": "TERMINAL", "hint": "Large building at an airport containing gates and services." },
    { "word": "CABIN CREW", "hint": "The staff on the airplane who assist passengers." },
    { "word": "TURBULENCE", "hint": "Sudden, unexpected aircraft movement; a normal part of flying." },
    { "word": "OVERHEAD BIN", "hint": "Storage area above the seats for carry-on bags." },
    { "word": "IN-FLIGHT SERVICE", "hint": "Meals, drinks and entertainment offered on board." },
    { "word": "EMERGENCY EXIT", "hint": "Doors used in an emergency; passengers nearby may be asked to help." },
    { "word": "SEAT BELT", "hint": "Safety device to wear during take-off, landing, and turbulence." },
    { "word": "LANDING GEAR", "hint": "Wheels of the plane used during take-off and landing." },
    { "word": "AISLE SEAT", "hint": "Seat next to the walkway; allows easier movement." },
    { "word": "WINDOW SEAT", "hint": "Seat next to the window; offers a view outside." },
    { "word": "COCKPIT", "hint": "Where the pilots control the plane; off-limits to passengers." },
    { "word": "LEGROOM", "hint": "Space for your legs under the seat in front; varies by seat class." },
    { "word": "IN-FLIGHT MAGAZINE", "hint": "Magazine provided by the airline with travel articles." },
    { "word": "WHEELCHAIR ACCESS", "hint": "Facilities for passengers with mobility challenges." },
    { "word": "DUTY-FREE SHOP", "hint": "Stores in international terminals selling tax-free products." },
    { "word": "CONNECTING FLIGHT", "hint": "A subsequent flight; allow enough time to change planes." },
    { "word": "UNACCOMPANIED MINOR SERVICE", "hint": "Assistance for children flying alone; arrange in advance." },
    { "word": "VEGETARIAN MEAL", "hint": "A meat-free food option; request when booking." },
    { "word": "MEDICAL ASSISTANCE", "hint": "Help with health issues during a flight; inform the crew." },
    { "word": "LOUNGE ACCESS", "hint": "Entry to exclusive waiting areas for premium passengers." },
    { "word": "PRE-BOARDING", "hint": "Allows families or special needs passengers to board first." },
    { "word": "RED-EYE FLIGHT", "hint": "An overnight flight often cheaper but disruptive to sleep." },
    { "word": "TRANSIT VISA", "hint": "Temporary visa required during some layovers." },
    { "word": "BUDGET AIRLINE", "hint": "Low-cost carrier offering fewer amenities." },
    { "word": "FIRST CLASS", "hint": "Highest level of service with extra comfort and amenities." },
    { "word": "LAYOVER", "hint": "Temporary stop in your journey; may require changing planes." },
    { "word": "ECONOMY CLASS", "hint": "Standard level of service; usually the most affordable." },
    { "word": "BUSINESS CLASS", "hint": "Premium service with more comfort than economy." },
    { "word": "NON-STOP FLIGHT", "hint": "Flight that travels directly without layovers." },
    { "word": "FREQUENT FLYER PROGRAM", "hint": "Rewards program that earns miles for regular travelers." },
    { "word": "STANDBY", "hint": "Ticket without a confirmed seat; waits for availability." },
    { "word": "CODE SHARE", "hint": "When two airlines share a flight; ticket may show another airline." },
    { "word": "AIR MARSHAL", "hint": "Plainclothes security officer on flights for passenger safety." },
    { "word": "CANCELLATION POLICY", "hint": "Rules and fees for cancelling a ticket." },
    { "word": "FINAL CALL", "hint": "The last announcement before the plane doors close." },
    { "word": "ON-TIME DEPARTURE", "hint": "A flight leaving at the scheduled time." },
    { "word": "LOST AND FOUND", "hint": "Place to report and recover lost items at the airport." },
    { "word": "BAGGAGE ALLOWANCE", "hint": "Weight or number of bags allowed to check." },
    { "word": "PLEASE HAVE YOUR PASSPORT READY", "hint": "Common announcement before immigration checks." },
    { "word": "FLIGHT ATTENDANT CALL BUTTON", "hint": "Button above your seat to request assistance." },
    { "word": "FASTEN YOUR SEAT BELTS", "hint": "Crew command to secure your seat belt when needed." },
    { "word": "GATE CHANGE", "hint": "Change to your departure gate; watch announcements and screens." },
    { "word": "NO SMOKING IN THE CABIN", "hint": "Rule on commercial flights forbidding smoking on board." }
  ]
}
